In [1]:
!ls

README.md             images                placeholderSmiley.png
Untitled.ipynb        kanye.jpg             requirements.txt
app.py                newWebcam.py          testFlask
backup.py             oneShotLearning.csv

In [3]:
import pandas as pd
import numpy as np
import seaborn as sns

In [6]:
face_df = pd.read_csv("./oneShotLearning.csv")

In [7]:
print(face_df)

   name   left   top  timestamp  numPerson  personId
0   Jim    428   404       3087          1         0
1   Jim    428   404       3087          1         0
2   Jim    448   404       3087          1         0
3   Jim    448   404       3087          1         0
4   Jim    428   404       3088          1         0
..  ...    ...   ...        ...        ...       ...
73  Jim    400   404       3112          1         0
74  Jim    424   428       3113          1         0
75  Jim    424   428       3113          1         0
76  Jim    448   404       3113          1         0
77  Jim    448   404       3113          1         0

[78 rows x 6 columns]

In [9]:
face_outputs = face_df[-5:]
face_outputs.head()

   name   left   top  timestamp  numPerson  personId
73  Jim    400   404       3112          1         0
74  Jim    424   428       3113          1         0
75  Jim    424   428       3113          1         0
76  Jim    448   404       3113          1         0
77  Jim    448   404       3113          1         0